
#Область ПрограммныйИнтерфейс

Функция ПоискДублей(ПараметрыРаботыСДублями) Экспорт
	
	Возврат РаботаСДублямиСервер.ПоискДублей(ПараметрыРаботыСДублями);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция Шаблон_ИнформацияОДублях() Экспорт
	
	Возврат РаботаСДублямиСервер.Шаблон_ИнформацияОДублях();
	
КонецФункции

Функция Шаблон_ПараметрыРаботыСДублями() Экспорт
	
	Возврат РаботаСДублямиСервер.Шаблон_ПараметрыРаботыСДублями();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
