
#Область ПрограммныйИнтерфейс

// Поиск дублей.
// 
// Параметры:
//  ПараметрыРаботыСДублями - Структура - См. Шаблон_ПараметрыРаботыСДублями()
// 
// Возвращаемое значение:
//  Структура - Поиск дублей:
// * ЕстьДубли - Булево - Истина если найдены дубли
// * ИнформацияОДублях - Произвольный, Неопределено - информация о дублях
Функция ПоискДублей(ПараметрыРаботыСДублями) Экспорт
	
	Возврат РаботаСДублямиСервер.ПоискДублей(ПараметрыРаботыСДублями);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Шаблон информация о дублях.
// 
// Возвращаемое значение:
//  Структура - Шаблон информация о дублях:
// * ЕстьДубли - Булево - Истина если найдены дубли
// * ИнформацияОДублях - Произвольный, Неопределено - информация о дублях
Функция Шаблон_ИнформацияОДублях() Экспорт
	
	Возврат РаботаСДублямиСервер.Шаблон_ИнформацияОДублях();
	
КонецФункции

// Шаблон параметры работы с дублями.
// 
// Возвращаемое значение:
//  Структура - Шаблон параметры работы с дублями:
// * ИмяГруппыДубли - Строка - имя элемента формы в котором размещаются элементы управления
// * ПодписьДубля - Строка - надпись на форму
// * ТекстЗапросаПоискДублей - Строка - текст запроса для поиска дублей
// * ПараметрыЗапросаПоискДублей - Структура - параметры запроса, ключ = имя параметра, значение = значение
Функция Шаблон_ПараметрыРаботыСДублями() Экспорт
	
	Возврат РаботаСДублямиСервер.Шаблон_ПараметрыРаботыСДублями();
	
КонецФункции

#КонецОбласти
