#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПроверяемыйОбъект = Параметры.ПроверяемыйОбъект;
	
	АдресВХ = Параметры.ИнформацияОДублях;
	ТаблицаДублей = ПолучитьИзВременногоХранилища(АдресВХ);
	СоздатьРеквизитЭлементыТаблицы(ТаблицаДублей);
	
	ПроверитьРазрешенаПометкаНеДубля(ТаблицаДублей);
	УстановитьДоступностьЭлементовФормы();
	ЗаполнитьТаблицуДублей(ТаблицаДублей);
	
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЭтоНеДубли(Команда)
	
	ИмяТаблицы = "ТаблицаДублей";
	ОтмеченныеСтроки = Элементы[ИмяТаблицы].ВыделенныеСтроки;
	Если ОтмеченныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДублей = ЭтотОбъект[ИмяТаблицы];
	
	Для Каждого СтрокаТаблицы Из ОтмеченныеСтроки Цикл
		
		СтрокаТаблицы = ТаблицаДублей.НайтиПоИдентификатору(СтрокаТаблицы);
		// TODO
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуДублей(ТаблицаЗначений)
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		//@skip-check bsl-legacy-check-string-literal
		НоваяСтрока = ЭтотОбъект["ТаблицаДублей"].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРазрешенаПометкаНеДубля(ТаблицаДублей)

	Если НЕ ЗначениеЗаполнено(ПроверяемыйОбъект) Тогда
		РазрешенаПометкаНеДубля = Ложь;
		Возврат;
	КонецЕсли;
	
	// Если нет колонки "Ссылка", то жее
	Если ТаблицаДублей.Колонки.Найти("Ссылка") = Неопределено Тогда
		РазрешенаПометкаНеДубля = Ложь;
		Возврат;
	КонецЕсли;
	
	РазрешенаПометкаНеДубля = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитЭлементыТаблицы(ТаблицаЗначений)

	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаДублей", Новый ОписаниеТипов("ТаблицаЗначений")));
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		МассивДобавляемыхРеквизитов.Добавить(
    		Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаДублей", Колонка.Имя));
	КонецЦикла;
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	ТаблицаФормы = Элементы.Добавить("ТаблицаДублей", Тип("ТаблицаФормы"), ЭтотОбъект);
	ТаблицаФормы.ПутьКДанным = "ТаблицаДублей";
	Элементы.Переместить(Элементы.ФормаЭтоНеДубли, ТаблицаФормы.КоманднаяПанель);
	
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		НоваяКолонка = Элементы.Добавить("ТаблицаДублей" + Колонка.Имя, Тип("ПолеФормы"), Элементы["ТаблицаДублей"]);
		НоваяКолонка.Заголовок = ПростыеТипыКлиентСервер.ИмяКолонкиВЗаголовок(Колонка.Имя);
		НоваяКолонка.ПутьКДанным = "ТаблицаДублей." + Колонка.Имя;
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ТолькоПросмотр = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.ФормаЭтоНеДубли.Видимость = РазрешенаПометкаНеДубля;
	
КонецПроцедуры

#КонецОбласти
