#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АдресВХ = Параметры.ИнформацияОДублях;
	ТаблицаДублей = ПолучитьИзВременногоХранилища(АдресВХ);
	СоздатьРеквизитЭлементыТаблицы(ТаблицаДублей);
	ЗаполнитьТаблицуДублей(ТаблицаДублей);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуДублей(ТаблицаЗначений)
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		//@skip-check bsl-legacy-check-string-literal
		НоваяСтрока = ЭтотОбъект["ТаблицаДублей"].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитЭлементыТаблицы(ТаблицаЗначений)

	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаДублей", Новый ОписаниеТипов("ТаблицаЗначений")));
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		МассивДобавляемыхРеквизитов.Добавить(
    		Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаДублей", Колонка.Имя));
	КонецЦикла;
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	ТаблицаФормы = Элементы.Добавить("ТаблицаДублей", Тип("ТаблицаФормы"), ЭтотОбъект);
	ТаблицаФормы.ПутьКДанным = "ТаблицаДублей";

	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		НоваяКолонка = Элементы.Добавить("ТаблицаДублей" + Колонка.Имя, Тип("ПолеФормы"), Элементы["ТаблицаДублей"]);
		НоваяКолонка.Заголовок = ПростыеТипыКлиентСервер.ИмяКолонкиВЗаголовок(Колонка.Имя);
		НоваяКолонка.ПутьКДанным = "ТаблицаДублей." + Колонка.Имя;
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
