#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоНовый() Тогда
		УстановитьСсылкуНового(Справочники.Слоги.ПолучитьСсылку(Новый УникальныйИдентификатор));
	КонецЕсли;
	ЗаполнитьЗаписьКаной();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьЗаписьКаной()
	
	ЗаписьХираганой = "";
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СлогиСостав.Моджи.ЮникодПредставление КАК МоджиПредставление
	|ИЗ
	|	Справочник.Слоги.Состав КАК СлогиСостав
	|ГДЕ
	|	СлогиСостав.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьХираганой = ЗаписьХираганой + Выборка.МоджиПредставление;
	КонецЦикла;
	
	ЗаписьКатаканой = "";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Слоги.Состав", "Слоги.СоставКатакана");
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьКатаканой = ЗаписьКатаканой + Выборка.МоджиПредставление;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе 
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

