#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗаписьКаной();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьЗаписьКаной()
	
	ЗаписьХираганой = "";
	Для Каждого СтрокаТЧ Из Состав Цикл
		
		ЗаписьХираганой = ЗаписьХираганой + СтрокаТЧ.Моджи.ЮникодПредставление;
		
	КонецЦикла;
	
	ЗаписьКатаканой = "";
	Для Каждого СтрокаТЧ Из СоставКатакана Цикл
		
		ЗаписьКатаканой = ЗаписьКатаканой + СтрокаТЧ.Моджи.ЮникодПредставление;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе 
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

