#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Удалить не дубли.
// 
// Параметры:
//  Ссылка - СправочникСсылка - Ссылка на уникальный объект
Процедура УдалитьНеДубли(Ссылка) Экспорт

	Набор1 = СоздатьНаборЗаписей();
	Набор1.Отбор.Элемент1.Установить(Ссылка);
	Набор1.Записать();
	
	Набор2 = СоздатьНаборЗаписей();
	Набор2.Отбор.Элемент2.Установить(Ссылка);
	Набор2.Записать();
	
КонецПроцедуры

// Записать связанные слова как не дубли.
// 
// Параметры:
//  Ссылка - СправочникСсылка - Ссылка на уникальный объект
//  СвязанныеСсылки - Массив из СправочникСсылка - Связанные слова
Процедура ЗаписатьНеДубли(Ссылка, СвязанныеСсылки) Экспорт
	
	УдалитьНеДубли(Ссылка);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Элемент1.Установить(Ссылка);
	
	Для Каждого СвязаннаяСсылка Из СвязанныеСсылки Цикл
		Если НЕ ЗначениеЗаполнено(СвязаннаяСсылка) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ОбщегоНазначения.СсылкаСуществует(СвязаннаяСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = НаборЗаписей.Добавить();
		Запись.Элемент1 = Ссылка;
		Запись.Элемент2 = СвязаннаяСсылка;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
