#Область ПрограммныйИнтерфейс

// Возвращает максимальную допустимую длину ключа для словарей.
//
// Возвращаемое значение:
//   Число - максимальная длина ключа словаря.
Функция МаксимальнаяДлинаКлючаСловарей () Экспорт
	
	Возврат 10; // TRUST ME
	
КонецФункции

// Конвертирует строку, введенную в одной раскладке, в другую по стандарту QWERTY.
//
// Параметры:
//   Строка - Строка - Строка для конвертации.
//
// Возвращаемое значение:
//   Строка - Сконвертированная строка.
//
Функция КонвертироватьРаскладкуQWERTY(Строка) Экспорт
	
	Если ПустаяСтрока(Строка) Тогда
		Возврат "";
	КонецЕсли;
	
	СоответствиеСимволов = СоответствиеСимволовДляКонвертацииРаскладки();
	
	Результат = "";
	Для Инд = 1 По СтрДлина(Строка) Цикл
		ТекущийСимвол = Сред(Строка, Инд, 1);
		СконвертированныйСимвол = СоответствиеСимволов.Получить(ТекущийСимвол);
		Результат = Результат + ?(СконвертированныйСимвол = Неопределено, ТекущийСимвол, СконвертированныйСимвол);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Служебные функции
//

// Возвращает соответствие символов для конвертации русской раскладки в английскую.
//
// Возвращаемое значение:
//   Соответствие из Строка - Словарь "РусскийСимвол" -> "АнглийскийСимвол".
//
Функция СоответствиеСимволовДляКонвертацииРаскладки()
	
	СоответствиеСимволов = Новый Соответствие;
	
	// Заполняем его построчно с помощью метода Вставить()
	СоответствиеСимволов.Вставить("й", "q");
	СоответствиеСимволов.Вставить("ц", "w");
	СоответствиеСимволов.Вставить("у", "e");
	СоответствиеСимволов.Вставить("к", "r");
	СоответствиеСимволов.Вставить("е", "t");
	СоответствиеСимволов.Вставить("н", "y");
	СоответствиеСимволов.Вставить("г", "u");
	СоответствиеСимволов.Вставить("ш", "i");
	СоответствиеСимволов.Вставить("щ", "o");
	СоответствиеСимволов.Вставить("з", "p");
	СоответствиеСимволов.Вставить("х", "[");
	СоответствиеСимволов.Вставить("ъ", "]");
	
	СоответствиеСимволов.Вставить("ф", "a");
	СоответствиеСимволов.Вставить("ы", "s");
	СоответствиеСимволов.Вставить("в", "d");
	СоответствиеСимволов.Вставить("а", "f");
	СоответствиеСимволов.Вставить("п", "g");
	СоответствиеСимволов.Вставить("р", "h");
	СоответствиеСимволов.Вставить("о", "j");
	СоответствиеСимволов.Вставить("л", "k");
	СоответствиеСимволов.Вставить("д", "l");
	СоответствиеСимволов.Вставить("ж", ";");
	СоответствиеСимволов.Вставить("э", "'");
	
	СоответствиеСимволов.Вставить("я", "z");
	СоответствиеСимволов.Вставить("ч", "x");
	СоответствиеСимволов.Вставить("с", "c");
	СоответствиеСимволов.Вставить("м", "v");
	СоответствиеСимволов.Вставить("и", "b");
	СоответствиеСимволов.Вставить("т", "n");
	СоответствиеСимволов.Вставить("ь", "m");
	СоответствиеСимволов.Вставить("б", ",");
	СоответствиеСимволов.Вставить("ю", ".");
	
	// Добавляем символы в верхнем регистре
	Для Каждого КлючИЗначение Из СоответствиеСимволов Цикл
		СоответствиеСимволов.Вставить(ВРег(КлючИЗначение.Ключ), ВРег(КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат СоответствиеСимволов;
	
КонецФункции

#КонецОбласти