#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет наименование объекта на основе данных из первого элемента табличной части "Чтения".
//
Процедура ЗаполнитьНаименование() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧтенияКанджи.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ЧтенияКанджи КАК ЧтенияКанджи
	|ГДЕ
	|	ЧтенияКанджи.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Чтения[0].Чтение);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаименование();
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
