
#Область ПрограммныйИнтерфейс

Процедура ПоискДублей(Форма) Экспорт
	
	Результат = РаботаСДублямиВызовСервера.ПоискДублей(Форма["ПараметрыРаботыСДублями"]);
	Если Результат.ЕстьДубли Тогда
		Форма.Элементы["НадписьДубли"].Видимость = Истина;
	Иначе
		Форма.Элементы["НадписьДубли"].Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура НадписьДублиНажатие(Форма) Экспорт
	Сообщить("Не трогай меня здесь!");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
