
#Область ПрограммныйИнтерфейс

// Поиск дублей и обновление информации на форме если найдены
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
// 
Процедура ПоискДублей(Форма) Экспорт
	
	//@skip-check bsl-legacy-check-string-literal
	ПараметрыРаботыСДублями = Форма["ПараметрыРаботыСДублями"];
	
	ПараметрыПоискаДублей = ПараметрыРаботыСДублями.ПараметрыЗапросаПоискДублей;
	
	ПрименяемыеПараметры = РаботаСДублямиВызовСервера.Шаблон_ПараметрыРаботыСДублями();
	ЗаполнитьЗначенияСвойств(ПрименяемыеПараметры, ПараметрыРаботыСДублями);
		
	ПрименяемыеПараметрыПоиска = Новый Структура;
	Для Каждого ПараметрПоиска Из ПараметрыПоискаДублей Цикл
		ПутьКРеквизиту = ПараметрПоиска.Значение;
		ЗначениеРеквизита = ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаФормы(Форма, ПутьКРеквизиту);
		ПрименяемыеПараметрыПоиска.Вставить(ПараметрПоиска.Ключ, ЗначениеРеквизита);
	КонецЦикла;
	
	ПрименяемыеПараметры.ПараметрыЗапросаПоискДублей = ПрименяемыеПараметрыПоиска;
	ПрименяемыеПараметры.Вставить("УникальныйИдентификаторФормы", Форма.УникальныйИдентификатор);
	
	Результат = РаботаСДублямиВызовСервера.ПоискДублей(ПрименяемыеПараметры);
	ОбработатьРезультатПоискаДублей(Форма, Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Надпись дубли нажатие.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура НадписьДублиНажатие(Форма) Экспорт
	
	//@skip-check bsl-legacy-check-string-literal
	ПараметрыРаботыСДублями = Форма["ПараметрыРаботыСДублями"];
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ПроверяемыйОбъект", ПараметрыРаботыСДублями.ПроверяемыйОбъект);
	ПараметрыОткрытия.Вставить("ИнформацияОДублях", Форма.ИнформацияОДублях);
	
	ОткрытьФорму("ОбщаяФорма.ФормаИнформацииОДублях", ПараметрыОткрытия, Форма, Форма.УникальныйИдентификатор, 
		Форма.Окно, Форма.НавигационнаяСсылка, , , РежимОтображенияОкнаФормы.ВОсновномОкне);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьРезультатПоискаДублей(Форма, Результат)
	
	Если Результат.ЕстьДубли Тогда
		Форма.Элементы["НадписьДубли"].Видимость = Истина;
		//@skip-check bsl-legacy-check-string-literal
		Форма["ИнформацияОДублях"] = Результат.ИнформацияОДублях;
	Иначе
		Форма.Элементы["НадписьДубли"].Видимость = Ложь;
		//@skip-check bsl-legacy-check-string-literal
		Форма["ИнформацияОДублях"] = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
