
#Область ПрограммныйИнтерфейс

// Поиск дублей и обновление информации на форме если найдены
// 
// Параметры:
//  Форма - Форма - Форма
// 
Процедура ПоискДублей(Форма) Экспорт
	
	//@skip-check bsl-legacy-check-string-literal
	ПараметрыРаботыСДублями = Форма["ПараметрыРаботыСДублями"];
	
	ПараметрыПоискаДублей = ПараметрыРаботыСДублями.ПараметрыЗапросаПоискДублей;
	
	ПрименяемыеПараметры = РаботаСДублямиВызовСервера.Шаблон_ПараметрыРаботыСДублями();
	ЗаполнитьЗначенияСвойств(ПрименяемыеПараметры, ПараметрыРаботыСДублями);
	
	ПрименяемыеПараметрыПоиска = Новый Структура;
	Для Каждого ПараметрПоиска Из ПараметрыПоискаДублей Цикл
		ПутьКРеквизиту = ПараметрПоиска.Значение;
		ЗначениеРеквизита = ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаФормы(Форма, ПутьКРеквизиту);
		ПрименяемыеПараметрыПоиска.Вставить(ПараметрПоиска.Ключ, ЗначениеРеквизита);
	КонецЦикла;
	ПрименяемыеПараметры.ПараметрыЗапросаПоискДублей = ПрименяемыеПараметрыПоиска;
	Результат = РаботаСДублямиВызовСервера.ПоискДублей(ПрименяемыеПараметры);
	ОбработатьРезультатПоискаДублей(Форма, Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура НадписьДублиНажатие(Форма) Экспорт
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Не трогай меня";
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьРезультатПоискаДублей(Форма, Результат)
	Если Результат.ЕстьДубли Тогда
		Форма.Элементы["НадписьДубли"].Видимость = Истина;
	Иначе
		Форма.Элементы["НадписьДубли"].Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
