#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьКатакану(Команда)
	ЗаполнитьКатакануНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьХирагану(Команда)
	ЗаполнитьХирагануНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКатакануНаСервере()
	Набор = РегистрыСведений.Катакана.СоздатьНаборЗаписей();
	Набор.Записать();
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаАзбука();
	Запрос.УстановитьПараметр("ЭтоКатакана", Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.Катакана.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Записать();	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьХирагануНаСервере()
	Набор = РегистрыСведений.Хирагана.СоздатьНаборЗаписей();
	Набор.Записать();
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаАзбука();
	Запрос.УстановитьПараметр("ЭтоКатакана", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.Хирагана.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Записать();	
	КонецЦикла;
	
КонецПроцедуры

// Возвращает текст запроса для получения данных из справочника Моджи с учетом фильтра по катакане
//
// Возвращаемое значение:
//   Строка - Текст запроса
&НаСервере
Функция ТекстЗапросаАзбука()
	БазовыйТекст =
	"ВЫБРАТЬ
	|	Моджи.Ссылка КАК Моджи,
	|	Моджи.Наименование КАК Наименование,
	|	Моджи.НаименованиеНаРусском КАК НаименованиеНаРусском,
	|	Моджи.Юникод КАК Юникод,
	|	Моджи.ЮникодПредставление КАК ЮникодПредставление
	|ИЗ
	|	Справочник.Моджи КАК Моджи
	|ГДЕ
	|	Моджи.ЭтоКатакана = &ЭтоКатакана
	|	И Моджи.ПометкаУдаления = ЛОЖЬ
	|	И Моджи.ЭтоМиниСимвол = ЛОЖЬ";
	
	Если ВключатьМиниСимволы Тогда
		Возврат СтрЗаменить(БазовыйТекст, "И Моджи.ЭтоМиниСимвол = ЛОЖЬ", "");
	Иначе
		Возврат БазовыйТекст;
	КонецЕсли;
	
КонецФункции
#КонецОбласти