
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("Наименование");
	Поля.Добавить("ЗаписьНаЯпонском");
	Поля.Добавить("Комментарий");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Данные.Наименование) Тогда
		Представление = "Словарь (новый)";	
	Иначе
		ТокеныЗначение = СтрРазделить(Данные.Комментарий, "(.;", Ложь);
		Если ТокеныЗначение.Количество() = 0 Тогда
			Значение = "(не указан перевод)";
		Иначе
			Значение = ТокеныЗначение[0];
		КонецЕсли;
		Представление = СтрШаблон("%1 (%2) - %3", Данные.Наименование, Данные.ЗаписьНаЯпонском, Значение);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
