#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Состав.Количество() > 0 Тогда
		ПервыйСлог = Состав[0].Слог;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Канджи") Тогда
		СтандартнаяОбработка = Ложь;
		КанджиОбъект = ДанныеЗаполнения.ПолучитьОбъект();
		Наименование = КанджиОбъект.Наименование;
		ЗаписьНаЯпонском = КанджиОбъект.ЮникодПредставление;
		
		Комментарий = КанджиОбъект.ОсновноеЗначение;
		
		Чтение = КанджиОбъект.Чтения[0].Чтение;
		Для Каждого СтрокаСлог Из Чтение.Состав Цикл
			НоваяСтрока = Состав.Добавить();
			НоваяСтрока.Слог = СтрокаСлог.Слог;
			НоваяСтрока.Запись = Перечисления.ВидыКаны.Хирагана;
			НоваяСтрока.Канджи = ДанныеЗаполнения;
			Расшифровка = Расшифровка + СтрокаСлог.Слог.ЗаписьХираганой;
		КонецЦикла;
		ПервыйСлог = Состав[0].Слог;
		
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДополнительныеСвойства.Вставить("ИсточникКопирования", ОбъектКопирования.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
