#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Выгрузка(Команда)
	
	#Если ВебКлиент Тогда
		ПоказатьПредупреждение(, "Выгрузка не поддерживается в веб-клиенте");
		Возврат;
	#КонецЕсли
	
	#Если НЕ ВебКлиент Тогда
	МассивКанджи = ДанныеКанджиДляВыгрузки();
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Если Диалог.Выбрать() Тогда
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.ОткрытьФайл(Диалог.ПолноеИмяФайла);
		
		ЗаписьJSON.ЗаписатьНачалоМассива();
		Для Каждого Канджи Из МассивКанджи Цикл
			ЗаписьJSON.ЗаписатьЗначение(Канджи);
		КонецЦикла;
		ЗаписьJSON.ЗаписатьКонецМассива();
		ЗаписьJSON.Закрыть();
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает массив канджи для выгрузки из справочника, начиная с указанного кода
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.Канджи - Массив канджи
&НаСервере
Функция ДанныеКанджиДляВыгрузки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Канджики.ЮникодПредставление КАК Канджи
	|ИЗ
	|	Справочник.Канджи КАК Канджики
	|ГДЕ
	|	Канджики.Код >= &Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	Канджики.Код";
	Запрос.УстановитьПараметр("Код", СтартовыйКод);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	МассивКанджи = Новый Массив;
	Счет = 0;
	Пока Выборка.Следующий() Цикл
		Счет = Счет + 1;
		Если Счет > Количество Тогда
			Возврат МассивКанджи;
		КонецЕсли;
		МассивКанджи.Добавить(Выборка.Канджи);
	КонецЦикла;
	
	Возврат МассивКанджи;
	
КонецФункции

#КонецОбласти