
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("Наименование");
	Поля.Добавить("ЮникодПредставление");
	Поля.Добавить("ЭтоМиниСимвол");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ИнфоМини = "";
	Если Данные.ЭтоМиниСимвол Тогда
		ИнфоМини = " мини";
	КонецЕсли;
	Представление = СтрШаблон("%1 (%2)%3", Данные.Наименование, Данные.ЮникодПредставление, ИнфоМини); 
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
