
#Область ПрограммныйИнтерфейс

// При создании на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив;
	// Создать в группе "ГруппаДубли" элементы управления для отображения дублей
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыРаботыСДублями") Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПараметрыРаботыСДублями", Новый ОписаниеТипов()));
	КонецЕсли;
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ИнформацияОДублях") Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИнформацияОДублях", Новый ОписаниеТипов()));
	КонецЕсли;
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если Форма.ПараметрыРаботыСДублями = Неопределено Тогда
		Форма.ПараметрыРаботыСДублями = Шаблон_ПараметрыРаботыСДублями();
	КонецЕсли;
	
	ИмяГруппы = Форма.ПараметрыРаботыСДублями.ИмяГруппыДубли;
	НовыйЭлемент = Форма.Элементы.Добавить("НадписьДубли", Тип("ДекорацияФормы"), Форма.Элементы[ИмяГруппы]);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Заголовок = Форма.ПараметрыРаботыСДублями.ПодписьДубля;
	НовыйЭлемент.Видимость = Истина;
	НовыйЭлемент.Шрифт = ШрифтыСтиля.ТекстТретьегоУровня;
	
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_НадписьДублиНажатие");
	//  
	
КонецПроцедуры

Функция ПоискДублей(Наименование) Экспорт
	
	Результат = Шаблон_ИнформацияОДублях();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Словарь.Ссылка КАК Ссылка,
	|	Словарь.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Словарь КАК Словарь
	|ГДЕ
	|	Словарь.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДубли = РезультатЗапроса.Выгрузить();
	Если ТаблицаДубли.Количество() > 1 Тогда
		Результат.ЕстьДубли = Истина;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция Шаблон_ИнформацияОДублях() Экспорт
	
	ИнформацияОДублях = Новый Структура;
	ИнформацияОДублях.Вставить("ЕстьДубли", Ложь);
	ИнформацияОДублях.Вставить("ИнформацияОДублях");
	Возврат ИнформацияОДублях;
	
КонецФункции

Функция Шаблон_ПараметрыРаботыСДублями() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяГруппыДубли", "ГруппаДубли");
	Параметры.Вставить("ПодписьДубля", "В базе существуют другие элементы, которые могут быть дублями текущего");
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
