
#Область ПрограммныйИнтерфейс

// При создании на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	// Создать в группе "ГруппаДубли" элементы управления для отображения дублей
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыРаботыСДублями") Тогда
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПараметрыРаботыСДублями", Новый ОписаниеТипов()));
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	
	Если Форма.ПараметрыРаботыСДублями = Неопределено Тогда
		Форма.ПараметрыРаботыСДублями = Шаблон_ПараметрыРаботыСДублями();
	КонецЕсли;
	
	ИмяГруппы = Форма.ПараметрыРаботыСДублями.ИмяГруппыДубли;
	НовыйЭлемент = Форма.Элементы.Добавить("НадписьДубли", Тип("ДекорацияФормы"), Форма.Элементы[ИмяГруппы]);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Заголовок = Форма.ПараметрыРаботыСДублями.ПодписьДубля;
	НовыйЭлемент.Видимость = Истина;
	НовыйЭлемент.Шрифт = ШрифтыСтиля.ТекстТретьегоУровня;
	
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_НадписьДублиНажатие");
	//  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция Шаблон_ПараметрыРаботыСДублями() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяГруппыДубли", "ГруппаДубли");
	Параметры.Вставить("ПодписьДубля", "В базе существуют другие элементы, которые могут быть дублями текущего");
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
