#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив слов, связанных с указанным словом в регистре сведений.
//
// Параметры:
//   Слово - СправочникСсылка.Словарь - Слово, для которого ищутся связанные слова
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.Словарь - Массив связанных слов
Функция СвязанныеСлова(Слово) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязанныеСлова.Слово2 КАК Слово
	|ИЗ
	|	РегистрСведений.СвязанныеСлова КАК СвязанныеСлова
	|ГДЕ
	|	СвязанныеСлова.Слово1 = &Слово
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СвязанныеСлова.Слово1
	|ИЗ
	|	РегистрСведений.СвязанныеСлова КАК СвязанныеСлова
	|ГДЕ
	|	СвязанныеСлова.Слово2 = &Слово
	|
	|УПОРЯДОЧИТЬ ПО
	|	Слово";
	Запрос.УстановитьПараметр("Слово", Слово);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Слово");
	
КонецФункции

#КонецОбласти

#КонецЕсли
