#Область СлужебныйПрограммныйИнтерфейс

// Конвертирует символ хираганы в соответствующий символ катаканы.
//
// Параметры:
//   Хирагана - СправочникСсылка.Моджи - Символ хираганы для конвертации.
//
// Возвращаемое значение:
//   СправочникСсылка.Моджи - Символ катаканы.
//
Функция Катакана(Хирагана) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаХираганаКатакана();
	Запрос.УстановитьПараметр("Моджи", Хирагана);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Катакана;
	
КонецФункции

// Конвертирует символ катаканы в соответствующий символ хираганы.
//
// Параметры:
//   Катакана - СправочникСсылка.Моджи - Символ катаканы для конвертации.
//
// Возвращаемое значение:
//   СправочникСсылка.Моджи - Символ хираганы.
//
Функция Хирагана(Катакана) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаКатаканаХирагана();
	Запрос.УстановитьПараметр("Моджи", Катакана);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Хирагана;
	
КонецФункции

// Создает и возвращает соответствие символов и слогов японской письменности (ромадзи) к их записи кириллицей.
//
// Возвращаемое значение:
//   Соответствие из Строка - структура, где ключом является строка на ромадзи, а значением - строка на кириллице.
Функция СоответствиеРомаджиКириллицы() Экспорт
	
	СоответствиеРК = Новый Соответствие;
	
	СоответствиеРКДобавитьСимволыПоГоджуон(СоответствиеРК);
	
	СоответствиеРКДобавитьСлогиНаЯЮЁ(СоответствиеРК);
	
	СоответствиеРКДобавитьМорыНаН(СоответствиеРК);
	
	СоответствиеРКДобавитьДвойныеГласные(СоответствиеРК);
	
	СоответствиеРКДобавитьДвойныеГласныеДвоеточие(СоответствиеРК);
	
	СоответствиеРКДобавитьСлогиСУдвоениемСогласных(СоответствиеРК);
	
	// спец. символ
	СоответствиеРК.Вставить("sokuon", "сокуон");
	
	Возврат СоответствиеРК;
	
КонецФункции

// Создает и возвращает соответствие символов ромаджи их юникод-кодам.
//
// Возвращаемое значение:
//   Соответствие из Структура - ключ - строка с символом ромаджи, значение - структура с данныме юникода
Функция СоответствиеРомаджиЮникоду() Экспорт
	
	СоответствиеРЮ = Новый Соответствие;
	
	СоответствиеРЮДобавитьСимволыПоГоджуон(СоответствиеРЮ);
	
	Возврат СоответствиеРЮ;
	
КонецФункции

// Формирует и возвращает словарь соответствия ромаджи данным слогов японского языка.
//
// Возвращаемое значение:
//   Соответствие из Строка - словарь, где ключом является строка ромаджи, а значением - массив структур с информацией о слоге
Функция СоответствиеРомаджиДаннымСлогов() Экспорт
	
	СоответствиеРДС = Новый Соответствие;
	СоответствиеРДСДобавитьСимволыПоГоджуон(СоответствиеРДС);
	СоответствиеРДСДобавитьСлогиНаЯЮЁ(СоответствиеРДС);
	СоответствиеРДСДобавитьДвойныеГласные(СоответствиеРДС);
	СоответствиеРДСДобавитьСлогиСУдвоениемСогласных(СоответствиеРДС);
	
	// спец. технический слог сокуон
	Моджи = Новый Массив;
	Моджи.Добавить(СтруктураДанныхРДС("Tsu", Истина));
	СоответствиеРДС.Вставить("sokuon", Моджи);
	
	Возврат СоответствиеРДС;
КонецФункции

// Возвращает соответствие, содержащее данные слогов с двойными гласными для преобразования в ромаджи.
//
// Возвращаемое значение:
//   Соответствие из Строка - словарь, где ключ - слог с двойной гласной, значение - его представление в ромаджи.
Функция СоответствиеРомаджиДаннымСлоговСДвойнымиГласными() Экспорт
	
	СоответствиеРДСДГ = Новый Соответствие;
	СоответствиеРДСДГДобавитьДвойныеГласные(СоответствиеРДСДГ);	
	Возврат СоответствиеРДСДГ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоответствиеРКДобавитьСимволыПоГоджуон(СоответствиеРК)
	
	СоответствиеРК.Вставить("a", "а");
	СоответствиеРК.Вставить("i", "и");
	СоответствиеРК.Вставить("u", "у");
	СоответствиеРК.Вставить("e", "э");
	СоответствиеРК.Вставить("o", "о");
	
	СоответствиеРК.Вставить("ka", "ка");
	СоответствиеРК.Вставить("ki", "ки");
	СоответствиеРК.Вставить("ku", "ку");
	СоответствиеРК.Вставить("ke", "кэ");
	СоответствиеРК.Вставить("ko", "ко");
	
	СоответствиеРК.Вставить("sa", "са");
	СоответствиеРК.Вставить("shi", "ши");
	СоответствиеРК.Вставить("su", "су");
	СоответствиеРК.Вставить("se", "сэ");
	СоответствиеРК.Вставить("so", "со");
	
	СоответствиеРК.Вставить("ta", "та");
	СоответствиеРК.Вставить("chi", "чи");
	СоответствиеРК.Вставить("tsu", "цу");
	СоответствиеРК.Вставить("te", "тэ");
	СоответствиеРК.Вставить("to", "то");
	
	СоответствиеРК.Вставить("na", "на");
	СоответствиеРК.Вставить("ni", "ни");
	СоответствиеРК.Вставить("nu", "ну");
	СоответствиеРК.Вставить("ne", "нэ");
	СоответствиеРК.Вставить("no", "но");
	
	СоответствиеРК.Вставить("ha", "ха");
	СоответствиеРК.Вставить("hi", "хи");
	СоответствиеРК.Вставить("fu", "фу");
	СоответствиеРК.Вставить("he", "хэ");
	СоответствиеРК.Вставить("ho", "хо");
	
	СоответствиеРК.Вставить("ma", "ма");
	СоответствиеРК.Вставить("mi", "ми");
	СоответствиеРК.Вставить("mu", "му");
	СоответствиеРК.Вставить("me", "мэ");
	СоответствиеРК.Вставить("mo", "мо");
	
	СоответствиеРК.Вставить("ya", "я");
	СоответствиеРК.Вставить("yu", "ю");
	СоответствиеРК.Вставить("yo", "ё");
	
	СоответствиеРК.Вставить("ra", "ра");
	СоответствиеРК.Вставить("ri", "ри");
	СоответствиеРК.Вставить("ru", "ру");
	СоответствиеРК.Вставить("re", "рэ");
	СоответствиеРК.Вставить("ro", "ро");
	
	СоответствиеРК.Вставить("wa", "ва");
	СоответствиеРК.Вставить("wo", "во");
	СоответствиеРК.Вставить("n", "н");
	
	// Дакутен (Га-ряд)
	СоответствиеРК.Вставить("ga", "га");
	СоответствиеРК.Вставить("gi", "ги");
	СоответствиеРК.Вставить("gu", "гу");
	СоответствиеРК.Вставить("ge", "гэ");
	СоответствиеРК.Вставить("go", "го");
	
	// Дакутен (Дза-ряд)
	СоответствиеРК.Вставить("za", "дза");
	СоответствиеРК.Вставить("ji", "джи");
	СоответствиеРК.Вставить("zu", "зу");
	СоответствиеРК.Вставить("ze", "дзэ");
	СоответствиеРК.Вставить("zo", "дзо");
	
	// Дакутен (Да-ряд)
	СоответствиеРК.Вставить("da", "да");
	СоответствиеРК.Вставить("dzu", "дзу"); // Альтернативное чтение для づ
	СоответствиеРК.Вставить("de", "дэ");
	СоответствиеРК.Вставить("do", "до");
	
	// Дакутен (Ба-ряд)
	СоответствиеРК.Вставить("ba", "ба");
	СоответствиеРК.Вставить("bi", "би");
	СоответствиеРК.Вставить("bu", "бу");
	СоответствиеРК.Вставить("be", "бэ");
	СоответствиеРК.Вставить("bo", "бо");
	
	// Хандакутен (Па-ряд)
	СоответствиеРК.Вставить("pa", "па");
	СоответствиеРК.Вставить("pi", "пи");
	СоответствиеРК.Вставить("pu", "пу");
	СоответствиеРК.Вставить("pe", "пэ");
	СоответствиеРК.Вставить("po", "по");
	
КонецПроцедуры

Процедура СоответствиеРКДобавитьСлогиНаЯЮЁ(СоответствиеРК)
	
	// Расширенные: Слоги с малыми я, ю, ё (ёон)
	СоответствиеРК.Вставить("kya", "кя");
	СоответствиеРК.Вставить("kyu", "кю");
	СоответствиеРК.Вставить("kyo", "кё");
	
	СоответствиеРК.Вставить("sha", "ша");
	СоответствиеРК.Вставить("shu", "шу");
	СоответствиеРК.Вставить("sho", "шо");
	
	СоответствиеРК.Вставить("cha", "ча");
	СоответствиеРК.Вставить("chu", "чу");
	СоответствиеРК.Вставить("cho", "чо");
	
	СоответствиеРК.Вставить("nya", "ня");
	СоответствиеРК.Вставить("nyu", "ню");
	СоответствиеРК.Вставить("nyo", "нё");
	
	СоответствиеРК.Вставить("hya", "хя");
	СоответствиеРК.Вставить("hyu", "хю");
	СоответствиеРК.Вставить("hyo", "хё");
	
	СоответствиеРК.Вставить("mya", "мя");
	СоответствиеРК.Вставить("myu", "мю");
	СоответствиеРК.Вставить("myo", "мё");
	
	СоответствиеРК.Вставить("rya", "ря");
	СоответствиеРК.Вставить("ryu", "рю");
	СоответствиеРК.Вставить("ryo", "рё");
	
	СоответствиеРК.Вставить("gya", "гя");
	СоответствиеРК.Вставить("gyu", "гю");
	СоответствиеРК.Вставить("gyo", "гё");
	
	СоответствиеРК.Вставить("ja", "джа");
	СоответствиеРК.Вставить("ju", "джу");
	СоответствиеРК.Вставить("jo", "джо");
	
	СоответствиеРК.Вставить("bya", "бя");
	СоответствиеРК.Вставить("byu", "бю");
	СоответствиеРК.Вставить("byo", "бё");
	
	СоответствиеРК.Вставить("pya", "пя");
	СоответствиеРК.Вставить("pyu", "пю");
	СоответствиеРК.Вставить("pyo", "пё");
	
КонецПроцедуры

Процедура СоответствиеРКДобавитьМорыНаН(СоответствиеРК)
	
	// Базовые слоги с -n
	СоответствиеРК.Вставить("an", "ан");
	СоответствиеРК.Вставить("in", "ин");
	СоответствиеРК.Вставить("un", "ун");
	СоответствиеРК.Вставить("en", "эн");
	СоответствиеРК.Вставить("on", "он");
	
	// Ка-ряд
	СоответствиеРК.Вставить("kan", "кан");
	СоответствиеРК.Вставить("kin", "кин");
	СоответствиеРК.Вставить("kun", "кун");
	СоответствиеРК.Вставить("ken", "кэн");
	СоответствиеРК.Вставить("kon", "кон");
	
	// Са-ряд
	СоответствиеРК.Вставить("san", "сан");
	СоответствиеРК.Вставить("shin", "шин");
	СоответствиеРК.Вставить("sun", "сун");
	СоответствиеРК.Вставить("sen", "сэн");
	СоответствиеРК.Вставить("son", "сон");
	
	// Та-ряд
	СоответствиеРК.Вставить("tan", "тан");
	СоответствиеРК.Вставить("chin", "чин");
	СоответствиеРК.Вставить("tsun", "цун");
	СоответствиеРК.Вставить("ten", "тэн");
	СоответствиеРК.Вставить("ton", "тон");
	
	// На-ряд
	СоответствиеРК.Вставить("nan", "нан");
	СоответствиеРК.Вставить("nin", "нин");
	СоответствиеРК.Вставить("nun", "нун");
	СоответствиеРК.Вставить("nen", "нэн");
	СоответствиеРК.Вставить("non", "нон");
	
	// Ха-ряд
	СоответствиеРК.Вставить("han", "хан");
	СоответствиеРК.Вставить("hin", "хин");
	СоответствиеРК.Вставить("fun", "фун");
	СоответствиеРК.Вставить("hen", "хэн");
	СоответствиеРК.Вставить("hon", "хон");
	
	// Ма-ряд
	СоответствиеРК.Вставить("man", "ман");
	СоответствиеРК.Вставить("min", "мин");
	СоответствиеРК.Вставить("mun", "мун");
	СоответствиеРК.Вставить("men", "мэн");
	СоответствиеРК.Вставить("mon", "мон");
	
	// Ра-ряд
	СоответствиеРК.Вставить("ran", "ран");
	СоответствиеРК.Вставить("rin", "рин");
	СоответствиеРК.Вставить("run", "рун");
	СоответствиеРК.Вставить("ren", "рэн");
	СоответствиеРК.Вставить("ron", "рон");
	
	// Ва-ряд и Н
	СоответствиеРК.Вставить("wan", "ван");
	СоответствиеРК.Вставить("win", "вин"); // Редко, но существует
	СоответствиеРК.Вставить("wen", "вэн"); // Редко, но существует
	СоответствиеРК.Вставить("won", "вон");
	
	// Га-ряд (Дакутен)
	СоответствиеРК.Вставить("gan", "ган");
	СоответствиеРК.Вставить("gin", "гин");
	СоответствиеРК.Вставить("gun", "гун");
	СоответствиеРК.Вставить("gen", "гэн");
	СоответствиеРК.Вставить("gon", "гон");
	
	// За-ряд (Дакутен)
	СоответствиеРК.Вставить("zan", "дзан");
	СоответствиеРК.Вставить("jin", "джин");
	СоответствиеРК.Вставить("zun", "зун");
	СоответствиеРК.Вставить("zen", "дзэн");
	СоответствиеРК.Вставить("zon", "дзон");
	
	// Да-ряд (Дакутен)
	СоответствиеРК.Вставить("dan", "дан");
	СоответствиеРК.Вставить("dzun", "дзун"); // Альтернативное чтение для づ
	СоответствиеРК.Вставить("den", "дэн");
	СоответствиеРК.Вставить("don", "дон");
	
	// Ба-ряд (Дакутен)
	СоответствиеРК.Вставить("ban", "бан");
	СоответствиеРК.Вставить("bin", "бин");
	СоответствиеРК.Вставить("bun", "бун");
	СоответствиеРК.Вставить("ben", "бэн");
	СоответствиеРК.Вставить("bon", "бон");
	
	// Па-ряд (Хандакутен)
	СоответствиеРК.Вставить("pan", "пан");
	СоответствиеРК.Вставить("pin", "пин");
	СоответствиеРК.Вставить("pun", "пун");
	СоответствиеРК.Вставить("pen", "пэн");
	СоответствиеРК.Вставить("pon", "пон");
	
	// Ёон (Слоги с малыми я/ю/ё) - Ка-ряд
	СоответствиеРК.Вставить("kyan", "кян");
	СоответствиеРК.Вставить("kyun", "кюн");
	СоответствиеРК.Вставить("kyon", "кён");
	
	// Ёон - Са-ряд
	СоответствиеРК.Вставить("shan", "шан");
	СоответствиеРК.Вставить("shun", "шун");
	СоответствиеРК.Вставить("shon", "шон");
	
	// Ёон - Та-ряд
	СоответствиеРК.Вставить("chan", "чан");
	СоответствиеРК.Вставить("chun", "чун");
	СоответствиеРК.Вставить("chon", "чон");
	
	// Ёон - На-ряд
	СоответствиеРК.Вставить("nyan", "нян");
	СоответствиеРК.Вставить("nyun", "нюн");
	СоответствиеРК.Вставить("nyon", "нён");
	
	// Ёон - Ха-ряд
	СоответствиеРК.Вставить("hyan", "хян");
	СоответствиеРК.Вставить("hyun", "хюн");
	СоответствиеРК.Вставить("hyon", "хён");
	
	// Ёон - Ма-ряд
	СоответствиеРК.Вставить("myan", "мян");
	СоответствиеРК.Вставить("myun", "мюн");
	СоответствиеРК.Вставить("myon", "мён");
	
	// Ёон - Ра-ряд
	СоответствиеРК.Вставить("ryan", "рян");
	СоответствиеРК.Вставить("ryun", "рюн");
	СоответствиеРК.Вставить("ryon", "рён");
	
	// Ёон - Га-ряд (Дакутен)
	СоответствиеРК.Вставить("gyan", "гян");
	СоответствиеРК.Вставить("gyun", "гюн");
	СоответствиеРК.Вставить("gyon", "гён");
	
	// Ёон - За-ряд (Дакутен)
	СоответствиеРК.Вставить("jan", "джан");
	СоответствиеРК.Вставить("jun", "джун");
	СоответствиеРК.Вставить("jon", "джон");
	
	// Ёон - Ба-ряд (Дакутен)
	СоответствиеРК.Вставить("byan", "бян");
	СоответствиеРК.Вставить("byun", "бюн");
	СоответствиеРК.Вставить("byon", "бён");
	
	// Ёон - Па-ряд (Хандакутен)
	СоответствиеРК.Вставить("pyan", "пян");
	СоответствиеРК.Вставить("pyun", "пюн");
	СоответствиеРК.Вставить("pyon", "пён");
	
КонецПроцедуры

Процедура СоответствиеРКДобавитьДвойныеГласныеДвоеточие(СоответствиеРК)
	// Простые долгие гласные (основные моры)
	СоответствиеРК.Вставить("a:", "а:");
	СоответствиеРК.Вставить("i:", "и:");
	СоответствиеРК.Вставить("u:", "у:");
	СоответствиеРК.Вставить("e:", "э:");
	СоответствиеРК.Вставить("o:", "о:");
	
	// Долгие гласные в составе слогов (Ка-ряд)
	СоответствиеРК.Вставить("ka:", "ка:");
	СоответствиеРК.Вставить("ki:", "ки:");
	СоответствиеРК.Вставить("ku:", "ку:");
	СоответствиеРК.Вставить("ke:", "кэ:");
	СоответствиеРК.Вставить("ko:", "ко:");
	
	// Долгие гласные (Са-ряд)
	СоответствиеРК.Вставить("sa:", "са:");
	СоответствиеРК.Вставить("shi:", "ши:");
	СоответствиеРК.Вставить("su:", "су:");
	СоответствиеРК.Вставить("se:", "сэ:");
	СоответствиеРК.Вставить("so:", "со:");
	
	// Долгие гласные (Та-ряд)
	СоответствиеРК.Вставить("ta:", "та:");
	СоответствиеРК.Вставить("chi:", "чи:");
	СоответствиеРК.Вставить("tsu:", "цу:");
	СоответствиеРК.Вставить("te:", "тэ:");
	СоответствиеРК.Вставить("to:", "то:");
	
	// Долгие гласные (На-ряд)
	СоответствиеРК.Вставить("na:", "на:");
	СоответствиеРК.Вставить("ni:", "ни:");
	СоответствиеРК.Вставить("nu:", "ну:");
	СоответствиеРК.Вставить("ne:", "нэ:");
	СоответствиеРК.Вставить("no:", "но:");
	
	// Долгие гласные (Ха-ряд)
	СоответствиеРК.Вставить("ha:", "ха:");
	СоответствиеРК.Вставить("hi:", "хи:");
	СоответствиеРК.Вставить("fu:", "фу:");
	СоответствиеРК.Вставить("he:", "хэ:");
	СоответствиеРК.Вставить("ho:", "хо:");
	
	// Долгие гласные (Ма-ряд)
	СоответствиеРК.Вставить("ma:", "ма:");
	СоответствиеРК.Вставить("mi:", "ми:");
	СоответствиеРК.Вставить("mu:", "му:");
	СоответствиеРК.Вставить("me:", "мэ:");
	СоответствиеРК.Вставить("mo:", "мо:");
	
	// Долгие гласные (Ра-ряд)
	СоответствиеРК.Вставить("ra:", "ра:");
	СоответствиеРК.Вставить("ri:", "ри:");
	СоответствиеРК.Вставить("ru:", "ру:");
	СоответствиеРК.Вставить("re:", "рэ:");
	СоответствиеРК.Вставить("ro:", "ро:");
	
	// Долгие гласные (Ва-ряд)
	СоответствиеРК.Вставить("wa:", "ва:");
	СоответствиеРК.Вставить("wo:", "о:"); // Долгий звук "о:"
	
	// Долгие гласные (Га-ряд, Дакутен)
	СоответствиеРК.Вставить("ga:", "га:");
	СоответствиеРК.Вставить("gi:", "ги:");
	СоответствиеРК.Вставить("gu:", "гу:");
	СоответствиеРК.Вставить("ge:", "гэ:");
	СоответствиеРК.Вставить("go:", "го:");
	
	// Долгие гласные (За-ряд, Дакутен)
	СоответствиеРК.Вставить("za:", "дза:");
	СоответствиеРК.Вставить("ji:", "джи:");
	СоответствиеРК.Вставить("zu:", "дзу:");
	СоответствиеРК.Вставить("ze:", "дзэ:");
	СоответствиеРК.Вставить("zo:", "дзо:");
	
	// Долгие гласные (Да-ряд, Дакутен)
	СоответствиеРК.Вставить("da:", "да:");
	СоответствиеРК.Вставить("ji:", "джи:"); // Альтернативное чтение для ぢ
	СоответствиеРК.Вставить("zu:", "дзу:"); // Альтернативное чтение для づ
	СоответствиеРК.Вставить("de:", "дэ:");
	СоответствиеРК.Вставить("do:", "до:");
	
	// Долгие гласные (Ба-ряд, Дакутен)
	СоответствиеРК.Вставить("ba:", "ба:");
	СоответствиеРК.Вставить("bi:", "би:");
	СоответствиеРК.Вставить("bu:", "бу:");
	СоответствиеРК.Вставить("be:", "бэ:");
	СоответствиеРК.Вставить("bo:", "бо:");
	
	// Долгие гласные (Па-ряд, Хандакутен)
	СоответствиеРК.Вставить("pa:", "па:");
	СоответствиеРК.Вставить("pi:", "пи:");
	СоответствиеРК.Вставить("pu:", "пу:");
	СоответствиеРК.Вставить("pe:", "пэ:");
	СоответствиеРК.Вставить("po:", "по:");
	
	// Долгие гласные для Ёон (слоги с малыми я/ю/ё)
	// Ка-ряд
	СоответствиеРК.Вставить("kya:", "кя:");
	СоответствиеРК.Вставить("kyu:", "кю:");
	СоответствиеРК.Вставить("kyo:", "кё:");
	
	// Са-ряд
	СоответствиеРК.Вставить("sha:", "ся:");
	СоответствиеРК.Вставить("shu:", "сю:");
	СоответствиеРК.Вставить("sho:", "сё:");
	
	// Та-ряд
	СоответствиеРК.Вставить("cha:", "тя:");
	СоответствиеРК.Вставить("chu:", "тю:");
	СоответствиеРК.Вставить("cho:", "тё:");
	
	// На-ряд
	СоответствиеРК.Вставить("nya:", "ня:");
	СоответствиеРК.Вставить("nyu:", "ню:");
	СоответствиеРК.Вставить("nyo:", "нё:");
	
	// Ха-ряд
	СоответствиеРК.Вставить("hya:", "хя:");
	СоответствиеРК.Вставить("hyu:", "хю:");
	СоответствиеРК.Вставить("hyo:", "хё:");
	
	// Ма-ряд
	СоответствиеРК.Вставить("mya:", "мя:");
	СоответствиеРК.Вставить("myu:", "мю:");
	СоответствиеРК.Вставить("myo:", "мё:");
	
	// Ра-ряд
	СоответствиеРК.Вставить("rya:", "ря:");
	СоответствиеРК.Вставить("ryu:", "рю:");
	СоответствиеРК.Вставить("ryo:", "рё:");
	
	// Га-ряд (Дакутен)
	СоответствиеРК.Вставить("gya:", "гя:");
	СоответствиеРК.Вставить("gyu:", "гю:");
	СоответствиеРК.Вставить("gyo:", "гё:");
	
	// Дза-ряд (Дакутен)
	СоответствиеРК.Вставить("ja:", "дзя:");
	СоответствиеРК.Вставить("ju:", "дзю:");
	СоответствиеРК.Вставить("jo:", "дзё:");
	
	// Ба-ряд (Дакутен)
	СоответствиеРК.Вставить("bya:", "бя:");
	СоответствиеРК.Вставить("byu:", "бю:");
	СоответствиеРК.Вставить("byo:", "бё:");
	
	// Па-ряд (Хандакутен)
	СоответствиеРК.Вставить("pya:", "пя:");
	СоответствиеРК.Вставить("pyu:", "пю:");
	СоответствиеРК.Вставить("pyo:", "пё:");
	
	
КонецПроцедуры

Процедура СоответствиеРКДобавитьДвойныеГласные(СоответствиеРК)
	
	// Варианты написания долгих гласных (основные)
	СоответствиеРК.Вставить("aa", "а:");
	СоответствиеРК.Вставить("ii", "и:");
	СоответствиеРК.Вставить("uu", "у:");
	СоответствиеРК.Вставить("ee", "э:");
	СоответствиеРК.Вставить("ei", "э:"); // Альтернативный вариант для "e:"
	СоответствиеРК.Вставить("oo", "о:");
	СоответствиеРК.Вставить("ou", "о:"); // Альтернативный вариант для "o:"
	
	// Долгие гласные в составе слогов (Ка-ряд)
	СоответствиеРК.Вставить("kaa", "ка:");
	СоответствиеРК.Вставить("kii", "ки:");
	СоответствиеРК.Вставить("kuu", "ку:");
	СоответствиеРК.Вставить("kee", "кэ:");
	СоответствиеРК.Вставить("kei", "кэй");
	СоответствиеРК.Вставить("koo", "ко:");
	СоответствиеРК.Вставить("kou", "ко:");
	
	// Долгие гласные (Са-ряд)
	СоответствиеРК.Вставить("saa", "са:");
	СоответствиеРК.Вставить("shii", "ши:");
	СоответствиеРК.Вставить("suu", "су:");
	СоответствиеРК.Вставить("see", "сэ:");
	СоответствиеРК.Вставить("sei", "сэй");
	СоответствиеРК.Вставить("soo", "со:");
	СоответствиеРК.Вставить("sou", "со:");
	
	// Долгие гласные (Та-ряд)
	СоответствиеРК.Вставить("taa", "та:");
	СоответствиеРК.Вставить("chii", "чи:");
	СоответствиеРК.Вставить("tsuu", "цу:");
	СоответствиеРК.Вставить("tee", "тэ:");
	СоответствиеРК.Вставить("tei", "тэй");
	СоответствиеРК.Вставить("too", "то:");
	СоответствиеРК.Вставить("tou", "то:");
	
	// Долгие гласные (На-ряд)
	СоответствиеРК.Вставить("naa", "на:");
	СоответствиеРК.Вставить("nii", "ни:");
	СоответствиеРК.Вставить("nuu", "ну:");
	СоответствиеРК.Вставить("nee", "нэ:");
	СоответствиеРК.Вставить("nei", "нэй");
	СоответствиеРК.Вставить("noo", "но:");
	СоответствиеРК.Вставить("nou", "но:");
	
	// Долгие гласные (Ха-ряд)
	СоответствиеРК.Вставить("haa", "ха:");
	СоответствиеРК.Вставить("hii", "хи:");
	СоответствиеРК.Вставить("fuu", "фу:");
	СоответствиеРК.Вставить("hee", "хэ:");
	СоответствиеРК.Вставить("hei", "хэй");
	СоответствиеРК.Вставить("hoo", "хо:");
	СоответствиеРК.Вставить("hou", "хо:");
	
	// Долгие гласные (Ма-ряд)
	СоответствиеРК.Вставить("maa", "ма:");
	СоответствиеРК.Вставить("mii", "ми:");
	СоответствиеРК.Вставить("muu", "му:");
	СоответствиеРК.Вставить("mee", "мэ:");
	СоответствиеРК.Вставить("mei", "мэй");
	СоответствиеРК.Вставить("moo", "мо:");
	СоответствиеРК.Вставить("mou", "мо:");
	
	// Долгие гласные (Ра-ряд)
	СоответствиеРК.Вставить("raa", "ра:");
	СоответствиеРК.Вставить("rii", "ри:");
	СоответствиеРК.Вставить("ruu", "ру:");
	СоответствиеРК.Вставить("ree", "рэ:");
	СоответствиеРК.Вставить("rei", "рэй");
	СоответствиеРК.Вставить("roo", "ро:");
	СоответствиеРК.Вставить("rou", "ро:");
	
	// Долгие гласные (Ва-ряд)
	СоответствиеРК.Вставить("waa", "ва:");
	СоответствиеРК.Вставить("woo", "о:");
	СоответствиеРК.Вставить("wou", "о:");
	
	// Долгие гласные (Га-ряд, Дакутен)
	СоответствиеРК.Вставить("gaa", "га:");
	СоответствиеРК.Вставить("gii", "ги:");
	СоответствиеРК.Вставить("guu", "гу:");
	СоответствиеРК.Вставить("gee", "гэ:");
	СоответствиеРК.Вставить("gei", "гэй");
	СоответствиеРК.Вставить("goo", "го:");
	СоответствиеРК.Вставить("gou", "го:");
	
	// Долгие гласные (За-ряд, Дакутен)
	СоответствиеРК.Вставить("zaa", "дза:");
	СоответствиеРК.Вставить("jii", "джи:");
	СоответствиеРК.Вставить("zuu", "дзу:");
	СоответствиеРК.Вставить("zee", "дзэ:");
	СоответствиеРК.Вставить("zei", "дзэй");
	СоответствиеРК.Вставить("zoo", "дзо:");
	СоответствиеРК.Вставить("zou", "дзо:");
	
	// Долгие гласные (Да-ряд, Дакутен)
	СоответствиеРК.Вставить("daa", "да:");
	СоответствиеРК.Вставить("jii", "джи:"); // Альтернативное чтение для ぢ
	СоответствиеРК.Вставить("zuu", "дзу:"); // Альтернативное чтение для づ
	СоответствиеРК.Вставить("dee", "дэ:");
	СоответствиеРК.Вставить("dei", "дэй");
	СоответствиеРК.Вставить("doo", "до:");
	СоответствиеРК.Вставить("dou", "до:");
	
	// Долгие гласные (Ба-ряд, Дакутен)
	СоответствиеРК.Вставить("baa", "ба:");
	СоответствиеРК.Вставить("bii", "би:");
	СоответствиеРК.Вставить("buu", "бу:");
	СоответствиеРК.Вставить("bee", "бэ:");
	СоответствиеРК.Вставить("bei", "бэй");
	СоответствиеРК.Вставить("boo", "бо:");
	СоответствиеРК.Вставить("bou", "бо:");
	
	// Долгие гласные (Па-ряд, Хандакутен)
	СоответствиеРК.Вставить("paa", "па:");
	СоответствиеРК.Вставить("pii", "пи:");
	СоответствиеРК.Вставить("puu", "пу:");
	СоответствиеРК.Вставить("pee", "пэ:");
	СоответствиеРК.Вставить("pei", "пэй");
	СоответствиеРК.Вставить("poo", "по:");
	СоответствиеРК.Вставить("pou", "по:");
	
	// Долгие гласные для Ёон (слоги с малыми я/ю/ё)
	// Ка-ряд
	СоответствиеРК.Вставить("kyaa", "кя:");
	СоответствиеРК.Вставить("kyuu", "кю:");
	СоответствиеРК.Вставить("kyoo", "кё:");
	СоответствиеРК.Вставить("kyou", "кё:");
	
	// Са-ряд
	СоответствиеРК.Вставить("shaa", "ся:");
	СоответствиеРК.Вставить("shuu", "сю:");
	СоответствиеРК.Вставить("shoo", "сё:");
	СоответствиеРК.Вставить("shou", "сё:");
	
	// Та-ряд
	СоответствиеРК.Вставить("chaa", "тя:");
	СоответствиеРК.Вставить("chuu", "тю:");
	СоответствиеРК.Вставить("choo", "тё:");
	СоответствиеРК.Вставить("chou", "тё:");
	
	// На-ряд
	СоответствиеРК.Вставить("nyaa", "ня:");
	СоответствиеРК.Вставить("nyuu", "ню:");
	СоответствиеРК.Вставить("nyoo", "нё:");
	СоответствиеРК.Вставить("nyou", "нё:");
	
	// Ха-ряд
	СоответствиеРК.Вставить("hyaa", "хя:");
	СоответствиеРК.Вставить("hyuu", "хю:");
	СоответствиеРК.Вставить("hyoo", "хё:");
	СоответствиеРК.Вставить("hyou", "хё:");
	
	// Ма-ряд
	СоответствиеРК.Вставить("myaa", "мя:");
	СоответствиеРК.Вставить("myuu", "мю:");
	СоответствиеРК.Вставить("myoo", "мё:");
	СоответствиеРК.Вставить("myou", "мё:");
	
	// Ра-ряд
	СоответствиеРК.Вставить("ryaa", "ря:");
	СоответствиеРК.Вставить("ryuu", "рю:");
	СоответствиеРК.Вставить("ryoo", "рё:");
	СоответствиеРК.Вставить("ryou", "рё:");
	
	// Га-ряд (Дакутен)
	СоответствиеРК.Вставить("gyaa", "гя:");
	СоответствиеРК.Вставить("gyuu", "гю:");
	СоответствиеРК.Вставить("gyoo", "гё:");
	СоответствиеРК.Вставить("gyou", "гё:");
	
	// Дза-ряд (Дакутен)
	СоответствиеРК.Вставить("jaa", "дзя:");
	СоответствиеРК.Вставить("juu", "дзю:");
	СоответствиеРК.Вставить("joo", "дзё:");
	СоответствиеРК.Вставить("jou", "дзё:");
	
	// Ба-ряд (Дакутен)
	СоответствиеРК.Вставить("byaa", "бя:");
	СоответствиеРК.Вставить("byuu", "бю:");
	СоответствиеРК.Вставить("byoo", "бё:");
	СоответствиеРК.Вставить("byou", "бё:");
	
	// Па-ряд (Хандакутен)
	СоответствиеРК.Вставить("pyaa", "пя:");
	СоответствиеРК.Вставить("pyuu", "пю:");
	СоответствиеРК.Вставить("pyoo", "пё:");
	СоответствиеРК.Вставить("pyou", "пё:");
	
КонецПроцедуры

Процедура СоответствиеРКДобавитьСлогиСУдвоениемСогласных(СоответствиеРК) Экспорт
	
	// Слоги с удвоением согласных (sokuon - малый цу)
	СоответствиеРК.Вставить("kka", "кка");
	СоответствиеРК.Вставить("kki", "кки");
	СоответствиеРК.Вставить("kku", "кку");
	СоответствиеРК.Вставить("kke", "ккэ");
	СоответствиеРК.Вставить("kko", "кко");

	СоответствиеРК.Вставить("ssa", "сса");
	СоответствиеРК.Вставить("sshi", "шши");
	СоответствиеРК.Вставить("ssu", "ссу");
	СоответствиеРК.Вставить("sse", "ссэ");
	СоответствиеРК.Вставить("sso", "ссо");

	СоответствиеРК.Вставить("tta", "тта");
	СоответствиеРК.Вставить("cchi", "тчи");
	СоответствиеРК.Вставить("ttsu", "тцу");
	СоответствиеРК.Вставить("tte", "ттэ");
	СоответствиеРК.Вставить("tto", "тто");

	СоответствиеРК.Вставить("ppa", "ппа");
	СоответствиеРК.Вставить("ppi", "ппи");
	СоответствиеРК.Вставить("ppu", "ппу");
	СоответствиеРК.Вставить("ppe", "ппэ");
	СоответствиеРК.Вставить("ppo", "ппо");

	// Удвоенные ёон
	СоответствиеРК.Вставить("kkya", "ккя");
	СоответствиеРК.Вставить("kkyu", "ккю");
	СоответствиеРК.Вставить("kkyo", "ккё");

	СоответствиеРК.Вставить("ssha", "шша");
	СоответствиеРК.Вставить("sshu", "шшу");
	СоответствиеРК.Вставить("ssho", "шшо");

	СоответствиеРК.Вставить("ccha", "тча");
	СоответствиеРК.Вставить("cchu", "тчу");
	СоответствиеРК.Вставить("ccho", "тчо");

	СоответствиеРК.Вставить("ppya", "ппя");
	СоответствиеРК.Вставить("ppyu", "ппю");
	СоответствиеРК.Вставить("ppyo", "ппё");
	
КонецПроцедуры

Процедура СоответствиеРЮДобавитьСимволыПоГоджуон(СоответствиеРЮ)
	
	// Гласные
	СоответствиеРЮ.Вставить("a", СтруктураДанныхРЮ("0x3042", "0x30A2", , "0x30A1"));
	СоответствиеРЮ.Вставить("i", СтруктураДанныхРЮ("0x3044", "0x30A4", , "0x30A3"));
	СоответствиеРЮ.Вставить("u", СтруктураДанныхРЮ("0x3046", "0x30A6", , "0x30A5"));
	СоответствиеРЮ.Вставить("e", СтруктураДанныхРЮ("0x3048", "0x30A8", , "0x30A7"));
	СоответствиеРЮ.Вставить("o", СтруктураДанныхРЮ("0x304A", "0x30AA", , "0x30A9"));
	
	// Ка-ряд
	СоответствиеРЮ.Вставить("ka", СтруктураДанныхРЮ("0x304B", "0x30AB"));
	СоответствиеРЮ.Вставить("ki", СтруктураДанныхРЮ("0x304D", "0x30AD"));
	СоответствиеРЮ.Вставить("ku", СтруктураДанныхРЮ("0x304F", "0x30AF"));
	СоответствиеРЮ.Вставить("ke", СтруктураДанныхРЮ("0x3051", "0x30B1"));
	СоответствиеРЮ.Вставить("ko", СтруктураДанныхРЮ("0x3053", "0x30B3"));
	
	// Са-ряд
	СоответствиеРЮ.Вставить("sa", СтруктураДанныхРЮ("0x3055", "0x30B5"));
	СоответствиеРЮ.Вставить("shi", СтруктураДанныхРЮ("0x3057", "0x30B7"));
	СоответствиеРЮ.Вставить("su", СтруктураДанныхРЮ("0x3059", "0x30B9"));
	СоответствиеРЮ.Вставить("se", СтруктураДанныхРЮ("0x305B", "0x30BB"));
	СоответствиеРЮ.Вставить("so", СтруктураДанныхРЮ("0x305D", "0x30BD"));
	
	// Та-ряд
	СоответствиеРЮ.Вставить("ta", СтруктураДанныхРЮ("0x305F", "0x30BF"));
	СоответствиеРЮ.Вставить("chi", СтруктураДанныхРЮ("0x3061", "0x30C1"));
	СоответствиеРЮ.Вставить("tsu", СтруктураДанныхРЮ("0x3064", "0x30C4", "0x3063", "0x30C3"));
	СоответствиеРЮ.Вставить("te", СтруктураДанныхРЮ("0x3066", "0x30C6"));
	СоответствиеРЮ.Вставить("to", СтруктураДанныхРЮ("0x3068", "0x30C8"));
	
	// На-ряд
	СоответствиеРЮ.Вставить("na", СтруктураДанныхРЮ("0x306A", "0x30CA"));
	СоответствиеРЮ.Вставить("ni", СтруктураДанныхРЮ("0x306B", "0x30CB"));
	СоответствиеРЮ.Вставить("nu", СтруктураДанныхРЮ("0x306C", "0x30CC"));
	СоответствиеРЮ.Вставить("ne", СтруктураДанныхРЮ("0x306D", "0x30CD"));
	СоответствиеРЮ.Вставить("no", СтруктураДанныхРЮ("0x306E", "0x30CE"));
	
	// Ха-ряд
	СоответствиеРЮ.Вставить("ha", СтруктураДанныхРЮ("0x306F", "0x30CF"));
	СоответствиеРЮ.Вставить("hi", СтруктураДанныхРЮ("0x3072", "0x30D2"));
	СоответствиеРЮ.Вставить("fu", СтруктураДанныхРЮ("0x3075", "0x30D5"));
	СоответствиеРЮ.Вставить("he", СтруктураДанныхРЮ("0x3078", "0x30D8"));
	СоответствиеРЮ.Вставить("ho", СтруктураДанныхРЮ("0x307B", "0x30DB"));
	
	// Ма-ряд
	СоответствиеРЮ.Вставить("ma", СтруктураДанныхРЮ("0x307E", "0x30DE"));
	СоответствиеРЮ.Вставить("mi", СтруктураДанныхРЮ("0x307F", "0x30DF"));
	СоответствиеРЮ.Вставить("mu", СтруктураДанныхРЮ("0x3080", "0x30E0"));
	СоответствиеРЮ.Вставить("me", СтруктураДанныхРЮ("0x3081", "0x30E1"));
	СоответствиеРЮ.Вставить("mo", СтруктураДанныхРЮ("0x3082", "0x30E2"));
	
	// Я-ряд
	СоответствиеРЮ.Вставить("ya", СтруктураДанныхРЮ("0x3084", "0x30E4", "0x3083", "0x30E3"));
	СоответствиеРЮ.Вставить("yu", СтруктураДанныхРЮ("0x3086", "0x30E6", "0x3085", "0x30E5"));
	СоответствиеРЮ.Вставить("yo", СтруктураДанныхРЮ("0x3088", "0x30E8", "0x3087", "0x30E7"));
	
	// Ра-ряд
	СоответствиеРЮ.Вставить("ra", СтруктураДанныхРЮ("0x3089", "0x30E9"));
	СоответствиеРЮ.Вставить("ri", СтруктураДанныхРЮ("0x308A", "0x30EA"));
	СоответствиеРЮ.Вставить("ru", СтруктураДанныхРЮ("0x308B", "0x30EB"));
	СоответствиеРЮ.Вставить("re", СтруктураДанныхРЮ("0x308C", "0x30EC"));
	СоответствиеРЮ.Вставить("ro", СтруктураДанныхРЮ("0x308D", "0x30ED"));
	
	// Ва-ряд
	СоответствиеРЮ.Вставить("wa", СтруктураДанныхРЮ("0x308F", "0x30EF"));
	СоответствиеРЮ.Вставить("wo", СтруктураДанныхРЮ("0x3092", "0x30F2"));
	СоответствиеРЮ.Вставить("n", СтруктураДанныхРЮ("0x3093", "0x30F3"));
	
	// Дакутен (Га-ряд)
	СоответствиеРЮ.Вставить("ga", СтруктураДанныхРЮ("0x304C", "0x30AC"));
	СоответствиеРЮ.Вставить("gi", СтруктураДанныхРЮ("0x304E", "0x30AE"));
	СоответствиеРЮ.Вставить("gu", СтруктураДанныхРЮ("0x3050", "0x30B0"));
	СоответствиеРЮ.Вставить("ge", СтруктураДанныхРЮ("0x3052", "0x30B2"));
	СоответствиеРЮ.Вставить("go", СтруктураДанныхРЮ("0x3054", "0x30B4"));
	
	// Дакутен (Дза-ряд)
	СоответствиеРЮ.Вставить("za", СтруктураДанныхРЮ("0x3056", "0x30B6"));
	СоответствиеРЮ.Вставить("ji", СтруктураДанныхРЮ("0x3058", "0x30B8"));
	СоответствиеРЮ.Вставить("zu", СтруктураДанныхРЮ("0x305A", "0x30BA"));
	СоответствиеРЮ.Вставить("ze", СтруктураДанныхРЮ("0x305C", "0x30BC"));
	СоответствиеРЮ.Вставить("zo", СтруктураДанныхРЮ("0x305E", "0x30BE"));
	
	// Дакутен (Да-ряд)
	СоответствиеРЮ.Вставить("da", СтруктураДанныхРЮ("0x3060", "0x30C0"));
	СоответствиеРЮ.Вставить("dzu", СтруктураДанныхРЮ("0x3065", "0x30C5"));
	СоответствиеРЮ.Вставить("de", СтруктураДанныхРЮ("0x3067", "0x30C7"));
	СоответствиеРЮ.Вставить("do", СтруктураДанныхРЮ("0x3069", "0x30C9"));
	
	// Дакутен (Ба-ряд)
	СоответствиеРЮ.Вставить("ba", СтруктураДанныхРЮ("0x3070", "0x30D0"));
	СоответствиеРЮ.Вставить("bi", СтруктураДанныхРЮ("0x3073", "0x30D3"));
	СоответствиеРЮ.Вставить("bu", СтруктураДанныхРЮ("0x3076", "0x30D6"));
	СоответствиеРЮ.Вставить("be", СтруктураДанныхРЮ("0x3079", "0x30D9"));
	СоответствиеРЮ.Вставить("bo", СтруктураДанныхРЮ("0x307C", "0x30DC"));
	
	// Хандакутен (Па-ряд)
	СоответствиеРЮ.Вставить("pa", СтруктураДанныхРЮ("0x3071", "0x30D1"));
	СоответствиеРЮ.Вставить("pi", СтруктураДанныхРЮ("0x3074", "0x30D4"));
	СоответствиеРЮ.Вставить("pu", СтруктураДанныхРЮ("0x3077", "0x30D7"));
	СоответствиеРЮ.Вставить("pe", СтруктураДанныхРЮ("0x307A", "0x30DA"));
	СоответствиеРЮ.Вставить("po", СтруктураДанныхРЮ("0x307D", "0x30DD"));
	
КонецПроцедуры

Процедура СоответствиеРДСДобавитьСимволыПоГоджуон(СоответствиеРДС)
	
	// Первая строка (гласные)
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "a");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "i");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "u");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "e");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "o");
	
	// Согласные ряда "к"
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ka");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ki");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ku");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ke");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ko");
	
	// Согласные ряда "с"
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "sa");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "shi");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "su");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "se");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "so");
	
	// Согласные ряда "т"
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ta");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "chi");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "tsu");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "te");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "to");
	
	// Согласные ряда "н"
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "na");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ni");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "nu");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ne");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "no");
	
	// Согласные ряда "х"
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ha");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "hi");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "fu");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "he");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ho");
	
	// Согласные ряда "м"
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ma");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "mi");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "mu");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "me");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "mo");
	
	// Согласные ряда "я"
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ya");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "yu");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "yo");
	
	// Согласные ряда "р"
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ra");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ri");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ru");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "re");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ro");
	
	// Согласные ряда "в"
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "wa");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "wo");
	
	// Слог "н"
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "n");
	
	// Символы с дакутеном (звонкие согласные)
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ga");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "gi");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "gu");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ge");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "go");

	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "za");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ji");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "zu");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ze");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "zo");

	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "da");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "dzu"); // альтернативное чтение
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "de");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "do");

	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "ba");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "bi");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "bu");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "be");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "bo");

	// Символы с хандакутеном (полузвонкие P-ряда)
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "pa");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "pi");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "pu");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "pe");
	СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, "po");
	
КонецПроцедуры

Процедура СоответствиеРДСДобавитьСимволПоГоджуон(СоответствиеРДС, Наименование)
	
	Моджи = Новый Массив;
	МоджиСтруктура = СтруктураДанныхРДС(ПростыеТипыКлиентСервер.ВНРег(Наименование), Ложь);
	Моджи.Добавить(МоджиСтруктура);
	СоответствиеРДС.Вставить(НРег(Наименование), Моджи);
	
КонецПроцедуры

Процедура СоответствиеРДСДобавитьСлогиНаЯЮЁ(СоответствиеРДС)
	
	// Согласные ряда "к" (k)
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "kya", "ki", "ya");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "kyu", "ki", "yu");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "kyo", "ki", "yo");

	// Согласные ряда "с" (s, sh)
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "sha", "shi", "ya");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "shu", "shi", "yu");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "sho", "shi", "yo");

	// Согласные ряда "т" (t, ch)
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "cha", "chi", "ya");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "chu", "chi", "yu");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "cho", "chi", "yo");

	// Согласные ряда "н" (n)
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "nya", "ni", "ya");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "nyu", "ni", "yu");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "nyo", "ni", "yo");

	// Согласные ряда "х" (h)
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "hya", "hi", "ya");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "hyu", "hi", "yu");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "hyo", "hi", "yo");

	// Согласные ряда "м" (m)
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "mya", "mi", "ya");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "myu", "mi", "yu");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "myo", "mi", "yo");

	// Согласные ряда "р" (r)
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "rya", "ri", "ya");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "ryu", "ri", "yu");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "ryo", "ri", "yo");	
	
	// Слоги с "P" + ёон
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "pya", "pi", "ya");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "pyu", "pi", "yu");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "pyo", "pi", "yo");
	
	// Слоги с "G" + ёон
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "gya", "gi", "ya");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "gyu", "gi", "yu");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "gyo", "gi", "yo");
	
	// Слоги с "J" + ёон
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "ja", "ji", "ya");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "ju", "ji", "yu");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "jo", "ji", "yo");
	
	// Слоги с "B" + ёон
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "bya", "bi", "ya");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "byu", "bi", "yu");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "byo", "bi", "yo");
	
	// Слоги с "TS" + ёон
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "tsa", "tsu", "a");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "tse", "tsu", "e");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "tso", "tsu", "o");
	
	// Особые слоги для заимствований
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "fa", "fu", "a");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "fe", "fu", "e");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "fo", "fu", "o");
	
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "dwa", "do", "a");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "dwe", "do", "e");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "dwi", "do", "i");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "dwo", "do", "o");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "dwu", "do", "u");
	
	// Слоги с удлиненными гласными для иностранных слов
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "kye", "ki", "e");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "gye", "gi", "e");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "nye", "ni", "e");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "hye", "hi", "e");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "bye", "bi", "e");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "pye", "pi", "e");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "mye", "mi", "e");
	СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, "rye", "ri", "e");

КонецПроцедуры

Процедура СоответствиеРДСДобавитьСлогНаЯЮЁ(СоответствиеРДС, Наименование, Часть1, Часть2)
	
	Часть1Моджи = СоответствиеРДС.Получить(НРег(Часть1));
	Если Часть1Моджи = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Моджи %1 нет в соответствии", Часть1);
	КонецЕсли;
	Часть2Моджи = СоответствиеРДС.Получить(НРег(Часть2));
	Если Часть2Моджи = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Моджи %1 нет в соответствии", Часть2);
	КонецЕсли;
	
	
	Моджи = Новый Массив;
	МоджиСтруктура = СтруктураДанныхРДС(ПростыеТипыКлиентСервер.ВНРег(Часть1), Ложь);
	Моджи.Добавить(МоджиСтруктура);
	МоджиСтруктура = СтруктураДанныхРДС(ПростыеТипыКлиентСервер.ВНРег(Часть2), Истина);
	Моджи.Добавить(МоджиСтруктура);
	
	СоответствиеРДС.Вставить(НРег(Наименование), Моджи);
	
КонецПроцедуры

//@skip-check module-unused-method
Процедура СоответствиеРДСДобавитьСлогиНаН(СоответствиеРДС)
	
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "an");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "in");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "un");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "en");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "on");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "kan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "kin");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "kun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "ken");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "kon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "san");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "shin");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "sun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "sen");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "son");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "tan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "chin");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "tsun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "ten");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "ton");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "nan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "nin");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "nun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "nen");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "non");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "han");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "hin");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "fun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "hen");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "hon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "man");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "min");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "mun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "men");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "mon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "ran");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "rin");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "run");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "ren");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "ron");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "wan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "won");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "gan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "gin");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "gun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "gen");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "gon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "zan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "jin");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "zun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "zen");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "zon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "dan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "dzun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "den");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "don");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "ban");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "bin");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "bun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "ben");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "bon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "pan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "pin");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "pun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "pen");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "pon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "kyan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "kyun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "kyon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "shan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "shun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "shon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "chan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "chun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "chon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "nyan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "nyun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "nyon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "hyan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "hyun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "hyon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "myan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "myun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "myon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "ryan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "ryun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "ryon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "gyan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "gyun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "gyon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "jan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "jun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "jon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "byan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "byun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "byon");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "pyan");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "pyun");
	СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, "pyon");
	
КонецПроцедуры

Процедура СоответствиеРДСДобавитьСлогНаН(СоответствиеРДС, Наименование)
	
	Часть1 = Лев(Наименование, СтрДлина(Наименование) - 1);
	
	Часть1Моджи = СоответствиеРДС.Получить(НРег(Часть1));
	Если Часть1Моджи = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Моджи %1 нет в соответствии", Часть1);
	КонецЕсли;
	
	Моджи = Новый Массив;
	
	Для Каждого Элемент Из Часть1Моджи Цикл
		МоджиСтруктура = Новый Структура("Наименование, ЭтоМиниСимвол");
		ЗаполнитьЗначенияСвойств(МоджиСтруктура, Элемент);
		Моджи.Добавить(МоджиСтруктура);
	КонецЦикла;
	
	МоджиСтруктура = Новый Структура("Наименование, ЭтоМиниСимвол", "N", Ложь);
	Моджи.Добавить(МоджиСтруктура);
	
	СоответствиеРДС.Вставить(НРег(Наименование), Моджи);
	
КонецПроцедуры

Процедура СоответствиеРДСДобавитьДвойныеГласные(СоответствиеРДС)
	
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "aa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ii");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "uu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ee");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ei"); // Альтернативный вариант для "e:"
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "oo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ou"); // Альтернативный вариант для "o:"
	
	// Долгие гласные в составе слогов (Ка-ряд)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kii");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kee");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kei");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "koo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kou");
	
	// Долгие гласные (Са-ряд)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "saa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "shii");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "suu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "see");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "sei");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "soo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "sou");
	
	// Долгие гласные (Та-ряд)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "taa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "chii");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "tsuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "tee");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "tei");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "too");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "tou");
	
	// Долгие гласные (На-ряд)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "naa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nii");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nee");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nei");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "noo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nou");
	
	// Долгие гласные (Ха-ряд)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "haa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hii");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "fuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hee");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hei");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hoo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hou");
	
	// Долгие гласные (Ма-ряд)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "maa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "mii");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "muu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "mee");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "mei");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "moo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "mou");
	
	// Долгие гласные (Ра-ряд)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "raa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "rii");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ruu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ree");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "rei");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "roo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "rou");
	
	// Долгие гласные (Ва-ряд)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "waa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "woo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "wou");
	
	// Долгие гласные (Га-ряд, Дакутен)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gii");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "guu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gee");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gei");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "goo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gou");
	
	// Долгие гласные (За-ряд, Дакутен)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "jii");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zee");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zei");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zoo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zou");
	
	// Долгие гласные (Да-ряд, Дакутен)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "daa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "jii"); // Альтернативное чтение для ぢ
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zuu"); // Альтернативное чтение для づ
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "dee");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "dei");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "doo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "dou");
	
	// Долгие гласные (Ба-ряд, Дакутен)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "baa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "bii");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "buu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "bee");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "bei");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "boo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "bou");
	
	// Долгие гласные (Па-ряд, Хандакутен)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "paa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pii");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "puu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pee");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pei");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "poo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pou");
	
	// Долгие гласные для Ёон (слоги с малыми я/ю/ё)
	// Ка-ряд
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kyaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kyuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kyoo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kyou");
	
	// Са-ряд
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "shaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "shuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "shoo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "shou");
	
	// Та-ряд
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "chaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "chuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "choo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "chou");
	
	// На-ряд
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nyaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nyuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nyoo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nyou");
	
	// Ха-ряд
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hyaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hyuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hyoo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hyou");
	
	// Ма-ряд
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "myaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "myuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "myoo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "myou");
	
	// Ра-ряд
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ryaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ryuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ryoo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ryou");
	
	// Га-ряд (Дакутен)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gyaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gyuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gyoo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gyou");
	
	// Дза-ряд (Дакутен)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "jaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "juu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "joo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "jou");
	
	// Ба-ряд (Дакутен)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "byaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "byuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "byoo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "byou");
	
	// Па-ряд (Хандакутен)
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pyaa");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pyuu");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pyoo");
	СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pyou");
	
КонецПроцедуры

Процедура СоответствиеРДСДобавитьДвойныеГласныеСлог(СоответствиеРДС, Наименование)
	
	Часть1 = Лев(Наименование, СтрДлина(Наименование) - 1);
	
	Часть1Моджи = СоответствиеРДС.Получить(НРег(Часть1));
	Если Часть1Моджи = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Моджи %1 нет в соответствии", Часть1);
	КонецЕсли;
	
	Моджи = Новый Массив;
	
	Для Каждого Элемент Из Часть1Моджи Цикл
		Моджи.Добавить(СтруктураДанныхРДС(Элемент.Наименование, Элемент.ЭтоМиниСимвол));
	КонецЦикла;
	
	Часть2 = ВРЕг(Прав(Наименование, 1));
	Если Часть2 = "E" Тогда
		Часть2 = "I"; // ei over ee
	КонецЕсли;
	
	Моджи.Добавить(СтруктураДанныхРДС(Часть2, Ложь));
	
	// СоответствиеРДС.Вставить(НРег(Наименование), Моджи);
	СоответствиеРДС.Вставить(НРег(Часть1) + ":", Моджи);
	
КонецПроцедуры

Процедура СоответствиеРДСДобавитьСлогиСУдвоениемСогласных(СоответствиеРДС)
	
	// Слоги с удвоением согласных (sokuon - малый цу)
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "kka");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "kki");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "kku");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "kke");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "kko");
	
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ssa");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "sshi");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ssu");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "sse");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "sso");
	
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "tta");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "cchi");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ttsu");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "tte");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "tto");
	
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ppa");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ppi");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ppu");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ppe");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ppo");
	
	// Удвоенные ёон
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "kkya");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "kkyu");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "kkyo");
	
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ssha");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "sshu");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ssho");
	
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ccha");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "cchu");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ccho");
	
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ppya");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ppyu");
	СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, "ppyo");
	
КонецПроцедуры

Процедура СоответствиеРДСДобавитьСлогСУдвоениемСогласных(СоответствиеРДС, Наименование)
	
	// Часть1 = Лев(Наименование, 1);
	Часть2 = Сред(Наименование, 2);
	
	Часть2Моджи = СоответствиеРДС.Получить(НРег(Часть2));
	Если Часть2Моджи = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Моджи %1 нет в соответствии", Часть2);
	КонецЕсли;
	
	Моджи = Новый Массив;
	Моджи.Добавить(СтруктураДанныхРДС("Tsu", Истина));
	
	Для Каждого Элемент Из Часть2Моджи Цикл
		Моджи.Добавить(СтруктураДанныхРДС(Элемент.Наименование, Элемент.ЭтоМиниСимвол));
	КонецЦикла;
	
	СоответствиеРДС.Вставить(НРег(Наименование), Моджи);
		
КонецПроцедуры

Процедура СоответствиеРДСДГДобавитьДвойныеГласные(СоответствиеРДС)
	
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "aa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ii");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "uu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ee");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ei"); // Альтернативный вариант для "e:"
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "oo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ou"); // Альтернативный вариант для "o:"
	
	// Долгие гласные в составе слогов (Ка-ряд)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kii");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kee");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kei");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "koo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kou");
	
	// Долгие гласные (Са-ряд)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "saa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "shii");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "suu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "see");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "sei");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "soo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "sou");
	
	// Долгие гласные (Та-ряд)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "taa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "chii");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "tsuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "tee");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "tei");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "too");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "tou");
	
	// Долгие гласные (На-ряд)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "naa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nii");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nee");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nei");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "noo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nou");
	
	// Долгие гласные (Ха-ряд)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "haa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hii");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "fuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hee");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hei");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hoo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hou");
	
	// Долгие гласные (Ма-ряд)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "maa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "mii");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "muu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "mee");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "mei");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "moo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "mou");
	
	// Долгие гласные (Ра-ряд)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "raa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "rii");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ruu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ree");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "rei");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "roo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "rou");
	
	// Долгие гласные (Ва-ряд)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "waa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "woo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "wou");
	
	// Долгие гласные (Га-ряд, Дакутен)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gii");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "guu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gee");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gei");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "goo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gou");
	
	// Долгие гласные (За-ряд, Дакутен)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "jii");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zee");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zei");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zoo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zou");
	
	// Долгие гласные (Да-ряд, Дакутен)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "daa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "jii"); // Альтернативное чтение для ぢ
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "zuu"); // Альтернативное чтение для づ
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "dee");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "dei");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "doo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "dou");
	
	// Долгие гласные (Ба-ряд, Дакутен)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "baa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "bii");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "buu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "bee");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "bei");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "boo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "bou");
	
	// Долгие гласные (Па-ряд, Хандакутен)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "paa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pii");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "puu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pee");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pei");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "poo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pou");
	
	// Долгие гласные для Ёон (слоги с малыми я/ю/ё)
	// Ка-ряд
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kyaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kyuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kyoo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "kyou");
	
	// Са-ряд
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "shaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "shuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "shoo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "shou");
	
	// Та-ряд
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "chaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "chuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "choo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "chou");
	
	// На-ряд
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nyaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nyuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nyoo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "nyou");
	
	// Ха-ряд
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hyaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hyuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hyoo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "hyou");
	
	// Ма-ряд
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "myaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "myuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "myoo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "myou");
	
	// Ра-ряд
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ryaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ryuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ryoo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "ryou");
	
	// Га-ряд (Дакутен)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gyaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gyuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gyoo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "gyou");
	
	// Дза-ряд (Дакутен)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "jaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "juu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "joo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "jou");
	
	// Ба-ряд (Дакутен)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "byaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "byuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "byoo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "byou");
	
	// Па-ряд (Хандакутен)
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pyaa");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pyuu");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pyoo");
	СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, "pyou");
	
КонецПроцедуры

Процедура СоответствиеРДСДГДобавитьДвойныеГласныеСлог(СоответствиеРДС, Наименование)
	
	СоответствиеРДС.Вставить(НРег(Наименование), Истина);
	
КонецПроцедуры

// Структура данных РЮ.
// 
// Параметры:
//  Юникод - Строка - Юникод
//  ЮникодКатакана - Строка - Юникод катакана
//  ЮникодМини - Неопределено, Строка - Юникод мини
//  ЮникодМиниКатакана - Неопределено, Строка - Юникод мини катакана
// 
// Возвращаемое значение:
//  Структура - Структура данных РЮ:
// * Юникод - Строка - Юникод
// * ЮникодКатакана - Строка - Юникод катакана
// * ЮникодМини - Неопределено, Строка - Юникод мини
// * ЮникодМиниКатакана - Неопределено, Строка - Юникод мини катакана
Функция СтруктураДанныхРЮ(Знач Юникод, Знач ЮникодКатакана, Знач ЮникодМини = Неопределено, Знач ЮникодМиниКатакана = Неопределено)
	
	Данные = Новый Структура;
	Данные.Вставить("Юникод", Юникод);
	Данные.Вставить("ЮникодКатакана", ЮникодКатакана);
	Данные.Вставить("ЮникодМини", ЮникодМини);
	Данные.Вставить("ЮникодМиниКатакана", ЮникодМиниКатакана);
	
	Возврат Данные;

КонецФункции

// Структура данных РДС.
// 
// Параметры:
//  Наименование - Строка - Наименование
//  ЭтоМиниСимвол - Булево - Это мини символ
// 
// Возвращаемое значение:
//  Структура - Структура данных РДС:
// * Наименование - Строка - Наименование
// * ЭтоМиниСимвол - Булево, Произвольный - Это мини символ
Функция СтруктураДанныхРДС(Наименование, ЭтоМиниСимвол)
	Возврат Новый Структура("Наименование, ЭтоМиниСимвол", Наименование, ЭтоМиниСимвол);
КонецФункции

// Возвращает текст запроса для поиска соответствия между хираганой и катаканой по заданному символу.
//
// Возвращаемое значение:
//   Строка - текст запроса
Функция ТекстЗапросаХираганаКатакана()
	
	Возврат 
	"ВЫБРАТЬ
	|	Катакана.Моджи КАК Катакана,
	|	Хирагана.Моджи КАК Хирагана
	|ИЗ
	|	РегистрСведений.Хирагана КАК Хирагана
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Катакана КАК Катакана
	|		ПО Хирагана.Моджи.Наименование = Катакана.Моджи.Наименование
	|ГДЕ
	|	Хирагана.Моджи = &Моджи";
	
КонецФункции

// Возвращает текст запроса для поиска соответствия между катаканой и хираганой по заданному символу.
//
// Возвращаемое значение:
//   Строка - текст запроса
Функция ТекстЗапросаКатаканаХирагана()
	
	Возврат СтрЗаменить(ТекстЗапросаХираганаКатакана(), "Хирагана.Моджи = &Моджи", "Катакана.Моджи = &Моджи");
	
КонецФункции

#КонецОбласти